CREATE TABLE phrases_views
(
    dt          DateTime,
    campaign_id Int32 comment 'Идентификатор рекламной кампании',
    phrase      String comment 'Поисковой запрос',
    views       Int32 comment 'Кумулятивное (суммарное) количество просмотров по поисковому запросу за всё время'
) engine = ReplacingMergeTree ORDER BY (dt, campaign_id, phrase);

INSERT INTO test.phrases_views (dt, campaign_id, phrase, views)
VALUES ('2025-01-01 11:50:00', 1111111, 'платье', 0),
       ('2025-01-01 12:00:00', 1111111, 'платье', 1),
       ('2025-01-01 12:10:00', 1111111, 'платье', 1),
       ('2025-01-01 12:20:00', 1111111, 'платье', 1),
       ('2025-01-01 12:30:00', 1111111, 'платье', 1),
       ('2025-01-01 12:40:00', 1111111, 'платье', 1),
       ('2025-01-01 12:50:00', 1111111, 'платье', 1),
       ('2025-01-01 13:00:00', 1111111, 'платье', 1),
       ('2025-01-01 13:10:00', 1111111, 'платье', 1),
       ('2025-01-01 13:20:00', 1111111, 'платье', 1),
       ('2025-01-01 13:30:00', 1111111, 'платье', 2),
       ('2025-01-01 13:40:00', 1111111, 'платье', 3),
       ('2025-01-01 13:50:00', 1111111, 'платье', 5),
       ('2025-01-01 14:00:00', 1111111, 'платье', 5),
       ('2025-01-01 14:10:00', 1111111, 'платье', 6),
       ('2025-01-01 14:20:00', 1111111, 'платье', 8),
       ('2025-01-01 14:30:00', 1111111, 'платье', 9),
       ('2025-01-01 14:40:00', 1111111, 'платье', 10),
       ('2025-01-01 14:50:00', 1111111, 'платье', 11),
       ('2025-01-01 15:00:00', 1111111, 'платье', 11),
       ('2025-01-01 15:10:00', 1111111, 'платье', 11),
       ('2025-01-01 15:20:00', 1111111, 'платье', 12),
       ('2025-01-01 15:30:00', 1111111, 'платье', 13),
       ('2025-01-01 15:40:00', 1111111, 'платье', 13),
       ('2025-01-01 15:50:00', 1111111, 'платье', 15),
       ('2025-01-01 16:00:00', 1111111, 'платье', 15);